[
    {
      "recipeId":"1",
      "name": "Cinnamon Roll Pancakes",
      "image":
        "https://images.kitchenstories.io/communityImages/f3340059b06039432c0860160c0bfb9b_0d79bef2-6b2c-4280-ad30-fa56a60445b6.jpg",
      "category": "breakfast",
      "cuisine": "american",
      "cook": "40 min.",
      "ingredients": [
        "250 g Plain flour",
        "4 tsp Baking Powder",
        "1 tsp Sea salt",
        "480 ml milk",
        "4 tbsp Maple syrup",
        "6 tbsp margarine",
        "15 tbsp Brown sugar",
        "4 tbsp Cinnamon powder",
        "240 g Icing sugar",
        "50 ml water"
      ],
      "instructions": [
        "In a bowl, whisk together flour, baking powder and salt. In a separate small bowl, whisk together milk and maple syrup.",
        "And the wet ingredients into the dry ingredients and whisk to combine.",
        "In a small bowl, combine together margarine, brown sugar and Cinnamon powder.",
        "Transfer the mixture to a pastry or zip-lock bag; snip-off one corner.",
        "Lightly grease a non-stick skillet. Pour a quarter cup of batter on to the skillet.",
        "Pipe a circular cinnamon swirl into the batter.",
        "When small bubbles appear on the center of the pancake- after about 4 minutes flip the pancake.",
        "Cook on the other side for about 1 minute. Repeat with the rest of the batter- adding oil to the skillet when needed.",
        "In a small bowl- combine confectioners sugar and water and whisk until smooth.",
        "Drizzle the glaze over the pancakes."
      ],
  
      "servings": "8"
    },
    {
      "recipeId":"2",
      "name": "Feel good vegetarian miso ramen",
      "image":
        "https://images.kitchenstories.io/wagtailOriginalImages/R2362-photo-final-4.jpg",
      "category": "lunch",
      "cuisine": "japanese",
      "cook": "45 min.",
      "ingredients": [
        "120 g ramen noodles",
        "2 tbsp white miso paste",
        "2 tbsp sesame seeds",
        "300 ml water",
        "¼ sheet kombu",
        "2 dried shiitake mushrooms",
        "15 g ginger",
        "2 garlic",
        "2 scallions",
        "2 eggs",
        "100 g shiitake mushrooms",
        "2 bok choy",
        "1 tbsp vegetable oil",
        "1 tsp Sriracha",
        "1 tsp agave nectar",
        "2 tbsp soy sauce",
        "300 ml soy milk",
        "scallion (for garnish)",
        "cilantro (for garnish)"
      ],
      "directions": [
        "For the vegetarian dashi broth, add water, kombu and dried shiitake mushrooms to a measuring cup. Leave to sit for at least 30 min. In the meantime,  continue with step 2. Then, once the 30 min has elapsed, add the dashi broth, plus the kombu and dried shiitake to a small pot and heat up over medium-high heat to intensify the flavor. Just before it reaches a boil, remove the kombu and mushrooms, turn off the heat and set aside for later.",
        "In a frying pan roast the sesame seeds until golden brown. Add to a food processor and pulse or grind finely with a mortar and pestle. Finely chop ginger and garlic, slice scallions into fine rings, separating the whites from the greens. Slice the fresh shiitake mushrooms and slice cut the pak choi lengthwise into quarters. Soft-boil the eggs by adding them to a saucepan boiling water and letting cook 6.5 min. before draining, and cooling under cold running water.",
        "Heat vegetable or sesame oil in a saucepan over medium heat. Sauté the shiitake mushrooms, remove and set aside. Add extra oil if needed, then add garlic, ginger and the white of the scallions in the same pot and sauté approx. 2 min. Add Sriracha, miso paste, agave nectar, soy sauce and ground sesame seeds. Sauté briefly. Now add the soy milk, stirring to remove any paste from the bottom of the pot.",
        "For a 2-person portion, add 200 ml/0,8 cup of the dashi broth and bring to boil. Reduce the heat and continue to simmer gently. In the meantime, prepare the ramen noodles according to the packing instructions. In the last minute, add the pak choi, blanch and drain.",
        "Divide the noodles and pak choi between two serving bowls. Pour the broth evenly on top. Garnish with shiitake mushrooms, halved waxy eggs and the green of the spring onions. Finish with fresh herbs, such as coriander, and gomasio (sesame salt) if you have it, or more sesame seeds. Enjoy!"
      ],
      "servings": "2"
    },
    {
      "recipeId":"3",
      "name": "Strawberries and cream tart",
      "image":
        "https://images.kitchenstories.io/wagtailOriginalImages/R2366-photo-final-1.jpg",
      "category": "dessert",
     "cuisine": "american",
     "prep": "25 min.",
      "cook": "40 min.",
      "ingredients": [
        "700 g strawberries",
        "150 g flour",
        "50 g whole-grain flour",
        "50 g almond flour",
        "1 tsp baking powder",
        "200 g butter",
        "170 g sugar",
        "1 egg",
        "400 ml milk",
        "200 ml cream",
        "1 package vanilla pudding powder",
        "1 tsp vanilla extract",
        "1 tbsp coconut sugar",
        "1 lemon zest",
        "salt",
        "butter (for greasing)"
      ],
      "directions": [
        "For the dough, add flour, whole-grain flour and almond flour to a large bowl. Cube the cold butter, add to the flour mix and knead with your hands to a sand-like consistency. Now add some sugar, baking powder, salt and the egg, and knead into a smooth dough. Shape into a ball, wrap in cling film, and leave to rest for approx. 1 hr.",
        "For the filling, heat milk with the remaining sugar in a small saucepan. In a separate bowl, mix some of the cream with the pudding powder. When the milk starts to boil, stir in the pudding mixture until dissolved, and let simmer for approx. 2 min. Then pour into a bowl, cover the surface of the pudding with cling film, and leave to cool in the fridge.",
        "Preheat the oven to 180°C/356°F. Roll out the dough between two sheets of parchment paper, place in a greased pie dish, trim the edges if needed, and prick all over with a fork. Place a sheet of parchment paper on top, fill with pie weights and bake in the preheated oven for 20 min. Remove from the oven and let cool completely.",
        "Whip the remaining cream with a hand mixer until stiff. Then whip the cooled vanilla pudding briefly with the hand mixer and fold in the whipped cream with a rubber spatula. Remove the tart base from the pie dish and fill with the vanilla pudding cream. Slice the strawberries into quarters and toss in a bowl with the vanilla extract, coconut sugar and lemon zest. Arrange  the strawberries in a circle around the outside edge and work your way into the middle, with the cut edge facing downwards. Finally let chill for approx. another 1 hr. before serving. Serve cold or at room temperature and enjoy!"
      ],
      "servings": "8"
    },
    {
      "recipeId":"4",
      "name": "Nutty Snack Bars",
      "image":
        "https://images.kitchenstories.io/communityImages/c0b4b1026931ea2b0659b264f87dfefc_d1878d04-5876-406c-93ef-94b5a55af7cd.jpg",
      "category": "snack",
      "cuisine": "american",
      "prep": "15 min.",
      "cook": "20 min.",
      "ingredients": [
        "⅓ cup honey",
        "¼ cup almond flour",
        "¼ tsp salt",
        "1 tbsp creamy peanut butter or creamy almond butter",
        "3½ oz raw unsalted pistachios ",
        "3½ oz raw unsalted almonds",
        "6 pitted dates",
        "¾ cup unsweetened shredded coconut",
        "1 tbsp flaxseed",
        "1 tbsp chia seed"
      ],
      "directions": [
        "Set your oven to 150°C/300°F and prep an 8-inch square baking pan with parchment paper or use a silicone tray.",
        "Roughly chop the pistachios and almonds and set aside.",
        "In a medium bowl, combine the honey, almond flour, salt, and peanut butter.",
        "Now add the almonds, pistachios, dates, coconut, chia seeds, and flax seeds to the peanut butter mix",
        "Tightly pack the mixture in the baking pan. Make use to firmly press the mixture as much as possible and as evenly as you can. If you are using a silicone mold, it is more difficult to tightly pack the mixture since the silicone is flexible.",
        "Bake for 20 minutes, then remove from the oven on to a wire rack. Do not remove the bars from the pan yet. Once they have cooled, let them rest in the refrigerator for an hour so that they all come together nicely. Then slice and enjoy!"
      ],
      "servings": "8"
    },
    {
      "recipeId":"5",
      "name": "Cheesy cauliflower pizza with shaved asparagus",
      "image":
        "https://images.kitchenstories.io/wagtailOriginalImages/R2336-photo-final-2.jpg",
      "category": "dinner",
      "cuisine": "italian",
      "prep": "35 min.",
      "cook": "40 min.",
      "ingredients": [
        "750 g cauliflower",
        "6 stalks green asparagus",
        "100 g Parmesan cheese",
        "70 g shredded mozzarella cheese",
        "50 g shredded Gouda cheese",
        "100 g crème fraîche",
        "1 clove garlic",
        "6 cherry tomatoes",
        "3 stalks parsley",
        "2 eggs",
        "½ tsp dried oregano",
        "1 pinch ground nutmeg",
        "2 tbsp sunflower seeds",
        "salt",
        "pepper",
        "flaky sea salt (for garnish)"
      ],
      "directions": [
        "Cut the cauliflower into florets. Add to a pot with boiling salted water and let simmer for approx. 5 min. or until fork tender. Let drain and return cauliflower to the stove over medium-low heat. Leave for approx. 5 min, stirring occasionally to let the steam out completely. Transfer to a baking sheet, spread out and leave to cool.",
        "Coarsely grate the Parmesan, chop the garlic, and halve the cherry tomatoes. Finely chop the parsley. Cut off the woody ends of the green asparagus, then use a vegetable peeler to carefully shave long lengths of asparagus.",
        "Mix the garlic, crème fraîche, one-third of the Parmesan, mozzarella, gouda, salt, and pepper in a bowl and set aside. Add cauliflower to a food processor and process until fine, but still with some texture. Now add cauliflower to a kitchen towel set over a bowl and tightly squeeze it out to release any extra liquid. Mix together in a bowl with two-thirds of the Parmesan, 2 eggs, oregano, nutmeg, salt, and pepper.",
        "Preheat the oven to 220°C/425F°. Spread the cauliflower mixture on a baking sheet lined with parchment paper. Press down with your hands to create the pizza crust. Transfer to the oven and bake for approx. 20 – 25 min., or until golden brown. Remove and let cool for approx. 15 min.",
        "Spread cheese sauce over the pizza base. Now arrange shaved asparagus on top, add halved cherry tomatoes and sprinkle with sunflower seeds. Return to the oven and bake for approx. 15 min. more. Garnish with parsley and flaky sea salt before serving and enjoy!"
      ],
      "servings": "2"
    }
  ]
  